In [1]:
import numpy as np
import pandas as pd

In [17]:
x={'name':['swag','sonu','sim'],'home':['jhinti','nuapatana','sarakana'],'status':['12th','NIT','PW'],'id':[1,4,3]}
data=pd.DataFrame(x)
data

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3

In [3]:
x=data['name'].tolist()
x

['swag', 'sonu', 'sim']

In [4]:
def ch(name,x):
    if name==x:
        return True
    else:
        return False

In [5]:
if ch('sonu',x):
     print(1)
else:
     print('n')

n

In [12]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

In [10]:
def chadd(df,name,age):
    if name not in df['Name'].values:
        new_row={'Name':name,'Age':age}
        df=df.append(new_row,ignore_index=True)
    return df

In [15]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}
df = pd.DataFrame(data)

# Function to check and add new row
def check_and_add_row(dataframe, name, age):
    if name not in dataframe['Name'].values:
        new_row = pd.Series({'Name': name, 'Age': age})
        dataframe.loc[len(dataframe)] = new_row
    return dataframe

# Get name and age from user
new_name = input("Enter a name: ")
new_age = int(input("Enter the age: "))

# Call the function to check and add new row
df = check_and_add_row(df, new_name, new_age)

print(df)

Enter a name: dhg
Enter the age: 87
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3      dhg   87

In [16]:
data

{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 22]}

In [18]:
data0

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3

In [19]:
frd_n=data0['name'].tolist()
frd_n

['swag', 'sonu', 'sim']

In [20]:
def add(name,l):
    if name==l:
        return True
    else:
        return False

In [23]:
def checkk(df,name):
    newr=pd.Series({'name':name,'home':'jasuapur','status':'bse','id':10})
    df.loc[len(df)] = newr
    return df

In [26]:
if add('sup',frd_n):
    print('p')
else:
    checkk(data0,'su')

In [27]:
data0

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3
3   sup   jasuapur    bse  10
4   sup   jasuapur    bse  10
5    su   jasuapur    bse  10

In [78]:
import numpy as np
import pandas as pd

In [79]:
x={'name':['swag','sonu','sim'],'home':['jhinti','nuapatana','sarakana'],'status':['12th','NIT','PW'],'id':[1,4,3]}
data=pd.DataFrame(x)
data

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3

In [80]:
data.to_csv('frds.csv',index=False)

In [81]:
data=pd.read_csv('frds.csv')
data

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3

In [82]:
names=data['name'].tolist()
names

['swag', 'sonu', 'sim']

In [100]:
def cinpon(frdname,List):
    # Collect data 1st here
    if frdname in List:
        print('yes')
    else:
        newfrdData={'name':frdname,'home':'nuapatana','status':'NIT','id':4}
        new_data=pd.Series(newfrdData)
        data.loc[len(data)]=new_data
#         cinpon('abulu',names)
#         data.to_csv('frds.csv',index=False)
#         names=data['name'].tolist()
#         print(names)

In [101]:
cinpon('swag',names)

yes

In [102]:
data=data.drop_duplicates()

data.to_csv('frds.csv',index=False)

In [103]:
data

   name       home status  id
0  swag     jhinti   12th   1
1  sonu  nuapatana    NIT   4
2   sim   sarakana     PW   3
3   sup  nuapatana    NIT   4
4  swag  nuapatana    NIT   4